orgs/nlg_standard_bench.org
#+title: A standard evaluation bench for NLG evaluations
#+date: Tue Mar 26 11:08:33 2024
#+author: Zi Liang
#+email: zi1415926.liang@connect.polyu.hk
#+latex_class: elegantpaper
#+filetags: :nlp:research:evaluation:


* Downstream Datasets

|-------------------------------+-----------------+----------|
| Card Name                     | selected SeqLen | Comments |
|-------------------------------+-----------------+----------|
| wikisql                       |             512 |          |
| spider                        |             512 |          |
|-------------------------------+-----------------+----------|
| allenai/common_gen            |             256 |          |
| e2e_nlg                       |             512 |          |
|-------------------------------+-----------------+----------|
| UCL-DARK/openai-tldr-filtered |            2048 | filter   |
| cnn_dailymail                 |            *4096* | filter   |
| samsum                        |            2048 | filter   |
|-------------------------------+-----------------+----------|
| piqa                          |             256 |          |
| truthful_qa                   |             256 |          |
| allenai/ai2_arc               |             256 |          |
|-------------------------------+-----------------+----------|



** Downstream Tasks: Status
*** Translation
**** REVIEW WMT16: cs-en
**** REVIEW WMT16: de-en
**** REVIEW WMT16: fi-en
*** Summarization
**** TODO TLDR
**** TODO cnn_dailymail ? *too long* 
**** TODO samsum
*** Structure Text generation
**** TODO WikiSQL
**** TODO Spider
*** Data-to-Text
**** TODO e2e_nlg
**** TODO CommonGen
*** Question Answering
**** TODO piqa
**** TODO truthful_qa
**** TODO allenai/ai2_arc
** Generalized Ability: Status
*** Safety
**** TODO HELM: bias, toxicity, fairness
**** TODO ...
*** Reasoning (math)
**** TODO MMLU (59 subsets)
