docs/nlg_standard_bench.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-05-10 Sun 17:17 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A standard evaluation bench for NLG evaluations</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/about.html" class="button">About</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">A standard evaluation bench for NLG evaluations</h1>
<div id="outline-container-org2e92043" class="outline-2">
<h2 id="org2e92043"><span class="section-number-2">1.</span> Downstream Datasets</h2>
<div class="outline-text-2" id="text-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Card Name</th>
<th scope="col" class="org-right">selected SeqLen</th>
<th scope="col" class="org-left">Comments</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">wikisql</td>
<td class="org-right">512</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">spider</td>
<td class="org-right">512</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">allenai/common_gen</td>
<td class="org-right">256</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">e2e_nlg</td>
<td class="org-right">512</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">UCL-DARK/openai-tldr-filtered</td>
<td class="org-right">2048</td>
<td class="org-left">filter</td>
</tr>

<tr>
<td class="org-left">cnn_dailymail</td>
<td class="org-right"><b>4096</b></td>
<td class="org-left">filter</td>
</tr>

<tr>
<td class="org-left">samsum</td>
<td class="org-right">2048</td>
<td class="org-left">filter</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">piqa</td>
<td class="org-right">256</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">truthful_qa</td>
<td class="org-right">256</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc</td>
<td class="org-right">256</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-orgfe1ba3e" class="outline-3">
<h3 id="orgfe1ba3e"><span class="section-number-3">1.1.</span> Downstream Tasks: Status</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org7f48919" class="outline-4">
<h4 id="org7f48919"><span class="section-number-4">1.1.1.</span> Translation</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org353cc01"></a><span class="todo REVIEW">REVIEW</span> WMT16: cs-en<br></li>
<li><a id="org6c0046b"></a><span class="todo REVIEW">REVIEW</span> WMT16: de-en<br></li>
<li><a id="org9a9b5b0"></a><span class="todo REVIEW">REVIEW</span> WMT16: fi-en<br></li>
</ol>
</div>
<div id="outline-container-org646dd0c" class="outline-4">
<h4 id="org646dd0c"><span class="section-number-4">1.1.2.</span> Summarization</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="org59c0f3f"></a><span class="todo TODO">TODO</span> TLDR<br></li>
<li><a id="orgbc9d1d3"></a><span class="todo TODO">TODO</span> cnn_dailymail ? <b>too long</b><br></li>
<li><a id="orgd72d299"></a><span class="todo TODO">TODO</span> samsum<br></li>
</ol>
</div>
<div id="outline-container-org611b71b" class="outline-4">
<h4 id="org611b71b"><span class="section-number-4">1.1.3.</span> Structure Text generation</h4>
<div class="outline-text-4" id="text-1-1-3">
</div>
<ol class="org-ol">
<li><a id="org340f8e0"></a><span class="todo TODO">TODO</span> WikiSQL<br></li>
<li><a id="orge436bc9"></a><span class="todo TODO">TODO</span> Spider<br></li>
</ol>
</div>
<div id="outline-container-orgc9304f8" class="outline-4">
<h4 id="orgc9304f8"><span class="section-number-4">1.1.4.</span> Data-to-Text</h4>
<div class="outline-text-4" id="text-1-1-4">
</div>
<ol class="org-ol">
<li><a id="org492258e"></a><span class="todo TODO">TODO</span> e2e_nlg<br></li>
<li><a id="org14f62f9"></a><span class="todo TODO">TODO</span> CommonGen<br></li>
</ol>
</div>
<div id="outline-container-orgeb61dc5" class="outline-4">
<h4 id="orgeb61dc5"><span class="section-number-4">1.1.5.</span> Question Answering</h4>
<div class="outline-text-4" id="text-1-1-5">
</div>
<ol class="org-ol">
<li><a id="orgdda387d"></a><span class="todo TODO">TODO</span> piqa<br></li>
<li><a id="orgfbed982"></a><span class="todo TODO">TODO</span> truthful_qa<br></li>
<li><a id="org71379e8"></a><span class="todo TODO">TODO</span> allenai/ai2_arc<br></li>
</ol>
</div>
</div>
<div id="outline-container-org796c2fa" class="outline-3">
<h3 id="org796c2fa"><span class="section-number-3">1.2.</span> Generalized Ability: Status</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgf560f24" class="outline-4">
<h4 id="orgf560f24"><span class="section-number-4">1.2.1.</span> Safety</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="org430cef7"></a><span class="todo TODO">TODO</span> HELM: bias, toxicity, fairness<br></li>
<li><a id="org17fab1a"></a><span class="todo TODO">TODO</span> &#x2026;<br></li>
</ol>
</div>
<div id="outline-container-org63a209d" class="outline-4">
<h4 id="org63a209d"><span class="section-number-4">1.2.2.</span> Reasoning (math)</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="org80be4c1"></a><span class="todo TODO">TODO</span> MMLU (59 subsets)<br></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr class="Solid"> <div class="info"> <span class="author">Author: Zi Liang (<a href="mailto:zi1415926.liang@connect.polyu.hk">zi1415926.liang@connect.polyu.hk</a>)</span> <span class="date">Create Date: Tue Mar 26 11:08:33 2024</span> <span class="date">Last modified: 2026-05-10 Sun 16:50</span> <span>Creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</span> </div>
</div>
</body>
</html>
